-- ● 더 공부하면 좋을 것
-- - grant : 권한 부여
-- - revoke : 권환 회수 (권한 없애기)
-- > 개발자가 사용하는 명령어는 아님.

-- - 넷째마당: PL/SQL
-- > 오라클에서만 사용가능한 데이터관련 프로그래밍 언어
-- > 변수, 조건문, 반복문
-- > 최근에는 점점 사용안하는 분위기임.
-- > 지금 당장 공부할 필요는 없어보인다.

-- ● 배운 것 중에 반드시 기억해야 하는 것.
-- - select, DML(insert, update, delete)
-- - dml: commit, rollback, 트랜잭션, 세션
-- - ddl: 당장읁 create, drop 정도면 됨, alter 찾아볼 정도만

-- ● 자격증
-- > 정보처리 관련 자격증에 데이터베이스 내용이 있음
-- > sqld, sqlp 정도면 괜찮음 -> 상위에  dap 라는 자격증도 있음.
-- >정보처리기사는 무조건 있어야 함.
-- >오라클 oca -> ocp -> ocm : 오라클 사용 빈도가 떨어지고 있기 때문에 그리 추천하지 않음.

-- ● 자바 웹 프로그래밍
-- > Java + Datebase
-- > 수업은 굉장히 재미가 없음
-- > 어떻게 만들지에 대한 단순 기술 암기
-- > 코딩이 많다.

-- ● 준비해야 할 것.
-- > 자바 복습
-- > 오라클 수업 때 배운 정도만 알고 있으면, 그 이상은 별로 필요없다.